# 関数と呼ばれる機能です、同じコードを簡単に再利用できるので数百行数千行になると大活躍です。
# add_yasai()はトマトを追加します、check_tomatoはトマト何個があるかを確認します
yasai_list = ["ピーマン","ナス","長ナス","トマト","ミニトマト","夕顔","和尚"]
def add_tomato():
    yasai_list.append("トマト")
    print("トマト")

def check_tomato():
    tomato_count = 0
    for i in yasai_list:
        if i == "トマト":
            print("🍅")
            tomato_count+=1
    print("アイテム" + str(tomato_count) + "個のトマト")
    for i in range(tomato_count):
        print("🍅",end='')
    print("")

## 関数は上に書くことが多いので初心者を苦しませることが多いです、冷静さを失わないのがコツです
for i in range(2):
    add_tomato()





 = []
